import React from 'react';
import Dialog from '@material-ui/core/Dialog';
import dvach from './2ch.jpg';
import logo from './15744112695650s.jpg';
import psy from './15744156714930.png';
import inf from './info.jpg';
import okay from './okay.png';
import './App.css';
const pnd = <div>Несколько фактов об откосе по психиатрии:
1) Доступно любому, причём не нужно гробить своё здоровье энергетиками как при откосе по гипертонии
2) Если заранее посетить ПНД и получить диагноз, то лежать в психбольнице от военкомата не придётся с шансом 99%, только придти и часик попиздеть с врачами
3) Так же посещение ПНД заранее гарантирует отправку на обследование психиатром военкомата - у него есть специальные списки психов. Но помни, что они обновляются до 3 месяцев, так что идти в ПНД за день до посещения военкомата не так хорошо, а сходить заранее (например, на последнем курсе вузика)
4) В любом случае от 5 до 30 дней в дурке явно лучше, чем 365 дней в армии. Особенно с учётом того, что в дурке никто не будет тебя пиздить или дрочить физуху. Просто лежи себе и плюй в потолок. А ещё в дурке в отличии от армии ебанаты тихие, ибо под таблетками. А вот в армии ебанаты могут оказаться твоим начальством.
5) Большинство психиатрических диагнозов ни на что в жизни не влияют. Просто не получай шизофрению лол. Но при этом в армию даёт негодность практически любой диагноз.
6) В любом случае ПНД только отвечает на запросы вида "может ли аноннейм работать на профессиянейм", никакие диагнозы ПНД не покидают. При этом не допустить могут только до работ на высоте, с детьми и т. д. Менеджером или программистом допускают в любом случае. Но даже на те профессии, что не допускают - не допускают только в период обострения. То есть шизик под таблетками может легально заниматься разными работами. Что уж говорить про невротические нарушения - тут вообще все дороги открыты в любое время, ибо я хз кем надо быть, чтобы их посчитали тяжёлым обострением. Наверное, надо прямо перед психиатром достать лезвие и вскрыть вены, не иначе. РЕАЛЬНЫЕ ПРОБЛЕМЫ будут только у тех, кто хочет работать в полиции/армии/ФСБ/МВД, а также пилотами. Но все кроме последних бегут в армию улюлюкая, а не пытаются косить. К тому же на всё перечисленное кроме последнего не возьмут с любым неслуживым военником. Похуй откосил ты по плоскостопию или психиатрии.
7) Учёта в ПНД ныне не существует. Но есть "диспансерное наблюдение". Так вот, его дают только шизикам и то не всем, а только самым ебанутым. Так вот, везде где говорят "требуется не состоять на учёте в ПНД" имеется ввиду диспансерное наблюдение.
8) Открой и почитай законы. Знаешь ли ты, например, что ДЕ ЮРЕ даже шизофреник может иметь права на машину. На пикриле три видно указание, что психические отклонения могут служить причиной отказа в получении прав только если они носят тяжёлый хронический характер. Впрочем, ДЕ ФАКТО шизофренику таки права не дадут без взятки, но вот почти с любым другим расстройством никаких проблем нет, тебе просто нужно быть адекватным на комиссии. Врачи, кстати, несут ответственность только за то, что ты адекватен здесь и сейчас. Если у тебя поедет крыша через несколько лет после получения справки, к ним никаких претензий не будет, так что они ничем не рискуют.
9) Если ты таки нашизил шизу (скорее всего она у тебя и так есть тогда лол имитировать очень сложно), но на машине кататься хочется, а взятку платить не хочется, то есть лайфхак - получить права в Грузии. Там в комиссии только окулист, экзамен на права проще (нет движения по городу, только по площадке), расходы дешевле (не считая дороги туда-обратно), а права действуют 15 лет вместо 10 российских. Минус только, что на работу с такими правами не устроишься, но если ты не планируешь зарабатывать на жизнь машиной, а онли для личных нужд.
10) У нас очень гуманное законодательство в области психиатрии. Упечь тебя в дурку или ещё чего практически не реально, пока ты не нарушаешь закон (а если нарушаешь, то дурка скорее всего будет лучшим из всех вариантов). Не ори про суицид перед врачом (не ори именно про суицид завтра, а не вообще) и будет тебе счастье.
11) Если хочешь диагноз потяжелее (хз зачем тебе это), то приди в ПНД немытым, небритым, нестриженным. Если хочешь диагноз полегче - приведи себя в порядок. Ещё стоит жаловаться на десоциализацию - отсутствие друзей, тян, девственность и т. д. Вылетевшие из универа/школы так же имеют преимущество.
12) Удачи!
13) Больше десяти лет назад в военнике перестали писать статью откоса. Таким образом ты можешь выбрать любую болячку подходящую под нужную категории годности (В или Д) из расписания болезней и всем называть её, кто будет доёбываться "почему не служил"

Пример вредного совета (от другого анона)
16) При первом визите в ПНД соблюдай три простых правила:
> а) Ни слова о суициде (можно уехать на скорой в дурку)
Это не так, мысли о [роскомнадзор] - нормальная вещь для человека, которому плохо. Естественно, не нужно кричать, что сейчас тут вскроюсь и резать вены.

в) Ни слова об армии (поймут, что ты уклонист)
> то, что человек в таком состоянии боится армии - нормально. Наоборот, если будешь орать сходу что НИ РАЗУ НЕ УКЛОНИСТ - будет очевидно обратноею</div>
const startinfo = <div>Совсем упрощенно, работает так.

1) Врач призывной комиссии делает осмотр, руководствуясь своей методичкой + твоей картой иным источникам информации по твоим болезням.
2) Если что то из этого соответствует непризывной категории В или Д документа "РАСПИСАНИЕ БОЛЕЗНЕЙ" (гуглится по первой ссылке), то районная комиссия признает тебя негодным.
3) Твое дело отправляется в комиссию субъекта федерации. Они могут либо согласиться и тогда:
а) получаешь военный билет
либо отправляют тебя на подтверждение диагноза (вот на этом пункте наебываются овердохуя челиков, которые "купили" диагноз у врача)
б) ты проходишь соответствующее обследование, районная комиссия подтверждает диагноз и ты получаешь военный билет</div>
function App() {
  const [open, setOpen] = React.useState(false);
  const [info, setInfo] = React.useState(<div></div>);
  const handleClickOpen = (text) => {
    setInfo(text);
    console.log(text);
    setOpen(true);
  };
 const redirect = ()=>{
   window.location='http://2ch.hk/wm/';
 }
  const handleClose = () => {
    setOpen(false);
  };
  return (
    <div className="App">
      <header className="App-header">
      <img src={dvach} onClick={redirect} style={{height: 100, width: 100, resizeMode: 'center', position: 'absolute',
     top: 20,
     left: 20}}/>

        <img src={logo} />
        <p>
          <h1> ОТКОС ОТ АРМЕЙКИ</h1>
        </p>
        <div style={{textAlign: 'center', display: 'inline-block'}}>
        <img
        style={{height: 400, width: 400, padding:10}}
            src={inf}
            onClick={()=>handleClickOpen(startinfo)}
        />

        <img
        style={{height: 400, width: 400, padding:10}}
            src={psy}
            onClick={()=>handleClickOpen(pnd)}
        />
</div>
      </header>
      <Dialog fullScreen open={open} onClose={handleClose} >
      {info}
      <img
         style={{height: 200, width: 200, resizeMode: 'center'}}
          src={okay}
          onClick={handleClose}
      />
      </Dialog>
    </div>
  );
}

export default App;
